/* 計算機概論實務-基本練習作業-作業18*/
/* 製作人：郭柏鋒 */
/* 完成時間：2019/05/07 01:15*/ 
#include<stdio.h>  //函示庫 
#include<string.h> //函示庫 
void main()
{
    char str[20]; //定義字串陣列 
    int i,num[256]={0}; 
    printf("計算機概論實務-基礎練習作業-作業18\n");
	printf("製作人：郭柏鋒\n");
	printf("完成時間：2019/05/07 01:15\n");
	printf("-------------------------------------------------\n");
	printf("              算每個數字出現的次數               \n");
	printf("-------------------------------------------------\n");    
    printf("輸入一個連串整數：");  
    scanf("%s",str); //輸入 
    for(i=0;i<strlen(str);i++) //做字串幾個的次數 
        num[(int)str[i]]++; 
    for(i=0;i<256;i++) //顯示出來 
        if(num[i]!=0)
            printf("字符%c出現%d次\n",(char)i,num[i]);
}
